# SolidUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidUtils Class
Members See Also
---
Contains utility functions for solid operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static class SolidUtils
```

Visual Basic
---
```text
Public NotInheritable Class SolidUtils
```

Visual C++
---
```text
public ref class SolidUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SolidUtils
# See Also
SolidUtils Members
Autodesk.Revit.DB Namespace